Switch from Mermaid to D2 diagrams
